
const questions = [
  {
    question: 'Питання №1: Що таке замикання (closure) в JavaScript?',
    options: [
      'Функція, яка приймає іншу функцію як аргумент.',
      'Об\'єкт, який зберігає дані і методи.',
      'Змінна, яка зберігає посилання на функцію поза її областю видимості.'
    ],
    correctAnswer: 'Змінна, яка зберігає посилання на функцію поза її областю видимості.'
  },
  {
    question: 'Питання №2: Що спричиняє створення замикання в JavaScript?',
    options: [
      'Використання ключового слова `this` в середині функції.',
      'Збереження посилання на функцію поза її областю видимості.',
      'Використання класів та об\'єктів.'
    ],
    correctAnswer: 'Збереження посилання на функцію поза її областю видимості.'
  },
  {
    question: 'Питання №3: Для чого можна використовувати замикання в JavaScript?',
    options: [
      'Для зберігання інформації про об\'єкти та їх властивості.',
      'Для огортування коду і забезпечення видимості змінних.',
      'Для підрахунку математичних операцій.'
    ],
    correctAnswer: 'Для огортування коду і забезпечення видимості змінних.'
  }
];

module.exports = questions