// task.js
const taskDescription = `
  Завдання: Розрахунок середнього балу

  Опис: Напишіть функцію, яка розраховує середній бал зі списку оцінок. Оцінки зберігаються у вигляді масиву чисел від 1 до 10.

  Вимоги:
  1. Створіть функцію calculateAverageGrade(grades), де grades - масив оцінок (цілі числа від 1 до 10).
  2. Функція має розраховувати середній бал з оцінок у списку.
  3. Якщо список оцінок порожній, поверніть значення null.
  4. Якщо серед оцінок є негативне значення або більше 10, викиньте виняток (exception) з повідомленням "Неприпустима оцінка".
`;

module.exports = taskDescription;
